app/workers/thermo_stat_worker.rb

  def perform(tracking_number)
    # Do something
    reading_params = Rails.cache.read(tracking_number)
    record = Reading.new(reading_params)
    record.save


    stats = ReadingStatistic.find_or_create_by(thermostat_id: record[:thermostat_id])
    stats.number_of_readings += 1
    stats.stemperature += record[:temperature]
    stats.shumidity += record[:humidity]
    stats.sbattery_charge += record[:battery_charge]

    stats.atemperature = stats.stemperature / stats.number_of_readings
    stats.ahumidity = stats.shumidity / stats.number_of_readings
    stats.abattery_charge = stats.sbattery_charge / stats.number_of_readings

    stats.max_temperature = record.temperature if record.temperature > stats.max_temperature
    stats.max_humidity = record.humidity if record.humidity > stats.max_humidity
    stats.max_battery_charge = record.battery_charge if record.battery_charge > stats.max_battery_charge

    if stats.min_temperature != nil
      stats.min_temperature = record.temperature if record.temperature < stats.max_temperature
      stats.min_humidity = record.humidity if record.humidity < stats.max_humidity
      stats.min_battery_charge = record.battery_charge if record.battery_charge < stats.max_battery_charge
    else
      stats.min_temperature = record.temperature
      stats.min_humidity = record.humidity
      stats.min_battery_charge = record.battery_charge
    end
    stats.save
---
INSERT INTO "readings" ("thermostat_id", "tracking_number", "temperature", "humidity", "battery_charge", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "reading_statistics" ("thermostat_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["thermostat_id", 1], ["created_at", "2019-07-03 21:28:13.300582"], ["updated_at", "2019-07-03 21:28:13.300582"]]
SELECT "reading_statistics".* FROM "reading_statistics" WHERE "reading_statistics"."thermostat_id" = $1 LIMIT $2  [["thermostat_id", 1], ["LIMIT", 1]]
UPDATE "reading_statistics" SET "number_of_readings" = $1, "stemperature" = $2, "shumidity" = $3, "sbattery_charge" = $4, "atemperature" = $5, "ahumidity" = $6, "abattery_charge" = $7, "max_temperature" = $8, "max_humidity" = $9, "max_battery_charge" = $10, "min_temperature" = $11, "min_humidity" = $12, "min_battery_charge" = $13, "updated_at" = $14 WHERE "reading_statistics"."id" = $15