app/controllers/readings_controller.rb

    def set_thermostat
      @thermostat = Thermostat.find_by_household_token!(params[:thermostat_id])
---
SELECT "thermostats".* FROM "thermostats" WHERE "thermostats"."household_token" = $1 LIMIT $2  [["household_token", "1234"], ["LIMIT", 1]]

    def set_reading
      @reading = Rails.cache.read(params[:id])
      @reading = Reading.find_by!(tracking_number: params[:id], thermostat_id: @thermostat.id) if @reading.nil?
---
SELECT "readings".* FROM "readings" WHERE "readings"."tracking_number" = $1 AND "readings"."thermostat_id" = $2 LIMIT $3  [["tracking_number", 2], ["thermostat_id", 1], ["LIMIT", 1]]