app/controllers/reading_statistics_controller.rb

  def index
    @reading_statistics = ReadingStatistic.all
---
SELECT "reading_statistics".* FROM "reading_statistics"

  def destroy
    @reading_statistic.destroy
---
DELETE FROM "reading_statistics" WHERE "reading_statistics"."id" = $1  [["id", 980190962]]

    def set_reading_statistic
      @reading_statistic = ReadingStatistic.find(params[:id])
---
SELECT "reading_statistics".* FROM "reading_statistics" WHERE "reading_statistics"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]