app/controllers/thermostats_controller.rb

UPDATE "thermostats" SET "household_token" = $1, "location" = $2, "updated_at" = $3 WHERE "thermostats"."id" = $4  [["household_token", "h1235"], ["location", "{\"city\":\"city1\"}"], ["updated_at", "2019-07-03 20:14:36.569482"], ["id", 980190964]]
---
  def update
    if @thermostat.update(thermostat_params)

DELETE FROM "thermostats" WHERE "thermostats"."id" = $1  [["id", 980190967]]
---
  def destroy
    @thermostat.destroy

SELECT "thermostats".* FROM "thermostats" WHERE "thermostats"."household_token" = $1 LIMIT $2  [["household_token", "980190962"], ["LIMIT", 1]]
---
    def set_thermostat
      @thermostat = Thermostat.find_by_household_token!(params[:id])