app/controllers/thermostats_controller.rb

SELECT "thermostats".* FROM "thermostats"
---
  def index
    @thermostats = Thermostat.all

INSERT INTO "thermostats" ("household_token", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["household_token", "1234"], ["location", "{\"city\":\"hyderabad\"}"], ["created_at", "2019-07-03 21:17:40.699785"], ["updated_at", "2019-07-03 21:17:40.699785"]]
---
  def create
    @thermostat = Thermostat.new(thermostat_params)

    if @thermostat.save

SELECT "reading_statistics".* FROM "reading_statistics" WHERE "reading_statistics"."thermostat_id" = $1 LIMIT $2  [["thermostat_id", 1], ["LIMIT", 1]]
---
  def stats
    record = ReadingStatistic.find_by(thermostat_id: @thermostat[:id])

SELECT "thermostats".* FROM "thermostats" WHERE "thermostats"."household_token" = $1 LIMIT $2  [["household_token", "1"], ["LIMIT", 1]]
---
    def set_thermostat
      @thermostat = Thermostat.find_by_household_token!(params[:id])